// pages/link/food/food.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    food: [{
      'class': '小宝菜',
      'items': ["鳗鱼饭", "响油鳝糊", "玫瑰花水","烤牛舌","红烧牛尾", "奇亚籽","腌笃鲜", "龙虾卷", "Burger","烤鱿鱼", "辣府", "槐柏树炸鸡","酱雪花牛肉"]
    },
      {
        'class': '东北菜',
        'items': ["锅包肉", "乱炖", "烀饼", "东北冷面", "拉皮", "酸菜排骨", "小鸡炖蘑菇", "东北烧烤"]
      },
      {
        'class': '延边菜',
        'items': ['延吉冷面', '明太鱼', '牛板筋', '桔梗菜', '拌花菜', '狗肉', '石锅饭', '打糕', '牛肉汤饭', '辣白菜', '狗肉汤']
      },
      {
        'class': '北京菜',
        'items': ['烤鸭', '卤煮火烧', '豆汁', '麻豆腐', '炸灌肠', '炙子烤肉', '炸酱面', '炒肝', '面茶', '糖火烧', '爆肚', '涮羊肉', '西四包子', '梨汤']
      },
      {
        'class': '河北、天津菜',
        'items': ['驴肉火烧', '煎饼果子', '锅巴菜']
      },
      {
        'class': '内蒙古菜',
        'items': ['蒙古奶茶', '风干牛肉', '烤全羊', '炒米', '对夹', '烧卖', '手把肉', '烤羊腿']
      },
      {
        'class': '山西菜',
        'items': ['过油肉', '刀削面', '霍州臊子面', '平遥牛肉', '羊杂割', '栲栳栳', '猫耳朵', '拨烂子', '莜面卷', '莜面鱼鱼', '铁锅焖面', '太谷饼']
      },
      {
        'class': '西北菜',
        'items': ['肉夹馍', '羊肉泡馍', '杨凌蘸水面', '岐山臊子面', '米皮', '凉皮', '油泼面', 'biangbiang面', '蒜蘸面', '裤带面', '洋芋擦擦', '炒麻什', '水盆羊肉', '牛肉面']
      },
      {
        'class': '山东菜',
        'items': ['德州扒鸡', '九转大肠', '汤爆双脆', '葱爆海参', '枣庄菜煎饼', '单县羊肉汤']
      },
      {
        'class': '河南菜',
        'items': ['烩面', '道口烧鸡', '开封灌汤包', '胡辣汤', '窝子面', '卤面', '桶子鸡', '水煎包', '板面']
      },
      {
        'class': '江苏菜',
        'items': ['腌笃鲜','响油鳝糊','汤包','牛肉锅贴','南京烤鸭','梅花糕','粢饭包油条','扬州盐水鹅','烫干丝','大煮干丝','扬州炒饭','鸭血粉丝汤','桂花糖芋苗','无锡酱排骨','老卤面','皮肚面','小煮面','赤豆元宵','黄桥烧饼','桂花糯米藕','盐水鸭','熏鱼','盱眙龙虾','秃黄油']
      },
      {
        'class': '江西菜',
        'items': ['瓦罐汤', '三杯鸡', '伊府面', '炒粉', '藜蒿炒腊肉', '南昌拌粉', '米粉蒸肉', '宜春扎粉', '抚州泡粉', '烫皮', '霉豆腐', '腐竹烧肉', '醪糟汤圆']
      },
      {
        'class': '上海本帮菜',
        'items': ['咸烧白', '油焖笋', '南翔小笼包', '三鲜小馄饨', '葱油拌面', '排骨年糕', '海棠糕', '条头糕薄荷糕']
      },
      {
        'class': '浙江菜',
        'items': ['叫花鸡', '东坡肉', '西湖牛肉羹', '西湖醋鱼', '金华火腿', '温州肉丸汤', '缙云爽面']
      },
      {
        'class': '福建菜',
        'items': ['佛跳墙', '肉燕', '土笋冻', '面线糊', '扁食', '芋丸', '三合面', '肉粽', '荔枝肉', '沙茶面', '兴化米粉', '海蛎煎', '福州鱼丸', '淡糟香螺片', '醉排骨', '肉松', '芋泥', '肉燕']
      },
      {
        'class': '粤菜',
        'items': ['白斩鸡', '烧鹅', '蜜汁叉烧', '煲仔饭', '肠粉', '干炒牛河', '潮州卤水', '潮汕牛肉火锅', '打边炉', '毋米粥', '鱼生', '鱼皮', '猪肚汤', '双皮奶', '姜撞奶', '流沙包', '杏仁茶', '芝麻糊', '凉茶', '炸鲜奶', '鸡仔饼', '绿豆沙', '艇仔粥', '虾饺', '云吞面', '细蓉面', '及第粥', '牛杂']
      },
      {
        'class': '广西菜',
        'items': ['酸笋炒仔肠', '脆皮鱼', '螺蛳粉', '芋头扣肉', '反沙芋头', '腐乳空心菜', '酸笋炒牛肉', '蓑衣蛋']
      },
      {
        'class': '湘菜',
        'items': ['辣椒炒肉', '津市牛肉粉', '油炸臭豆腐', '剁椒鱼头', '口味虾', '糖油粑粑', '蒿子粑粑', '宁乡兰花干', '酱板鸭', '米豆腐', '干锅茶树菇', '老长沙大香肠', '火焙鱼', '擂辣椒皮蛋', '小炒黄牛肉', '金钱蛋']
      },
      {
        'class': '湖北菜',
        'items': ['莲藕排骨汤', '热干面', '周黑鸭', '武昌鱼', '四季美汤包', '孝感米酒', '珍珠丸子', '三鲜豆皮']
      },
      {
        'class': '四川、重庆菜',
        'items': ['口水鸡', '四川火锅', '冒菜', '回锅肉', '蒜泥白肉', '冰粉', '蛋烘糕', '辣子鸡', '鱼香肉丝', '宫保鸡丁', '水煮鱼', '水煮肉', '夫妻肺片', '麻婆豆腐', '廖记棒棒鸡', '泡椒凤爪', '开水白菜', '酸菜鱼', '龙抄手', '钟水饺', '担担面', '宜宾燃面', '赖汤圆', '韩包子', '杂酱面', '跷脚牛肉', '渣渣面', '叶儿粑', '凉糕', '串串']
      },
      {
        'class': '贵州菜',
        'items': ['丝娃娃', '酸汤鱼', '豆腐圆子', '花溪牛肉粉', '肠旺面', '洋芋粑粑', '小米酢', '烙锅', '恋爱豆腐果', '香酥鸭']
      },
      {
        'class': '云南菜',
        'items': ['过桥米线', '鲜花饼', '烤乳扇', '汽锅鸡', '黑三剁', '牛肝菌', '菠萝饭', '香茅草烤鱼', '凉米线', '云腿月饼', '赛鸡枞', '丽江粑粑', '薄荷卷牛肉', '老奶洋芋']
      },
      {
        'class': '新疆菜',
        'items': ['大盘鸡', '羊肉串', '烤羊腿', '拉条子', '椒麻鸡', '手抓羊肉', '手抓饭', '馕包肉', '烤包子', '酿皮子']
      },
      {
        'class': '海南菜',
        'items': ['清补凉', '海南鸡饭', '椰子鸡火锅', '文昌鸡', '加积鸭', '东山羊', '和乐蟹', '黄灯笼辣椒酱', '斋菜煲', '老虎鱼粥', '海南粉']
      },
      {
        'class': '藏区菜',
        'items': ['牦牛肉', '西藏酸奶', '青稞酒']
      },
      {
        'class': '港澳菜',
        'items': ['菠萝包', '菠萝油', '冻柠茶', '咸柠七', '煲仔饭', '避风塘炒蟹', '烧腊', '许留山', '鸡蛋仔', '港式奶茶', '蛋挞', '鱼蛋', '老婆饼', '碗仔翅', '牛杂']
      },
      {
        'class': '台湾菜',
        'items': ['大肠包小肠', '台湾奶茶', '凤梨酥', '卤肉饭', '蛤仔煎', '生煎包', '担仔面', '盐酥鸡', '棺材板', '台式三杯鸡', '芋圆', '牛轧糖', '车仔面', '爆浆鸡排', '鸡翅包饭', '挫冰']
      },
      {
        'class': '东南亚菜',
        'items': ['越南牛肉河粉', '冬阴功汤', '越南米卷', '泰国奶茶', '烤猪颈肉', '咖喱炒海鲜', '越南炸春卷', '越南火锅', '甘蔗虾', '甜豆花', '什锦糖水', '芒果糯米饭', '泰式炒面', '菠萝饭', '青木瓜沙拉', '咖喱蟹', '椰汁鸡汤', '泰国炒冰', '绿咖喱鸡', '茶叶沙拉', '泰式烤鱿鱼']
      },
      {
        'class': '日本菜',
        'items': ['刺身', '和牛肉', '亲子丼', '寿司', '鳗鱼饭', '铜锣烧', '章鱼小丸子', '豚骨拉面', '海鲜饭', '红颜草莓', '寿喜烧', '玉子烧', '鲷鱼烧', '天妇罗', '炸猪肉饼', '仙贝', '纳豆', '大阪烧', '大福', '清酒', '乌冬面', '荞麦面', '鸡肉串', '可乐饼', '和果子', '茶碗蒸', '味增汤']
      },
      {
        'class': '韩国菜',
        'items': ['韩式炸鸡', '炒年糕', '生拌牛肉', '芝士年糕火锅', '部队锅', '韩式烤肉', '大酱汤', '冷面', '辣白菜', '桔梗菜', '石锅拌饭', '参鸡汤', '炒米肠', '紫菜包饭', '辣八爪鱼']
      },
      {
        'class': '墨西哥菜',
        'items': ['Burrito 卷', 'Taco', '蘸酱玉米片', 'Enchiladas', 'Pozole鸡肉玉米红白汤', 'Empanadas墨式馅饼']
      }
    ],

    foodSelect: 0,
    foodClass: []

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function(options) {
    let a, b;
    let c = [];
    let that = this;
    wx.setNavigationBarTitle({
      title: '人生·終極·問題'
    })
    var screenHeight = wx.getSystemInfo({
      success: function(res) {
        a = 0.905 * res.windowHeight;
        b = res.windowWidth;
      }
    });

    this.setData({
      screenHeight: a,
      screenWidth: b
    });

    for (let i = 0; i < this.data.food.length; i++) {
      c.push(this.data.food[i].class);
      console.log('菜系种类：' + this.data.foodClass);
    };

    this.setData({
      foodClass: c
    });

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function() {

  },

  foodPickerChange: function(e) {
    this.setData({
      foodSelect: e.detail.value
    });
    console.log('foodValue设置为' + this.data.food[this.data.foodSelect].class);
  }
})